# GetDefaultConnectionHandlerType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandlerType..::..GetDefaultConnectionHandlerType Method
StructuralConnectionHandlerType Class See Also
---
Gets a default type id for Structural Connection.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static ElementId GetDefaultConnectionHandlerType(
	Document pADoc
)
```

Visual Basic
---
```text
Public Shared Function GetDefaultConnectionHandlerType ( _
	pADoc As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetDefaultConnectionHandlerType(
	Document^ pADoc
)
```

# ### Parameters
pADoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The type id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace